{
  "blogs": [
    {
      "title": "blog one",
      "body": "this is where text will go",
      "topic": "Beef Initiative",
      "id": 1
    },
    {
      "title": "blog two",
      "body": "this is where text will go",
      "topic": "Beef Initiative",
      "id": 2
    },
    {
      "title": "blog three",
      "body": "this is where text will go",
      "topic": "Bitcoin",
      "id": 3
    },
    {
      "title": "Learning Bitcoin: Adoption in Africa",
      "body": "Every now and then, I stumble across an idea or protocol that is so exciting — potentially revolutionary, in this case — that I stop what I’m doing and make sure to cover it. <p> This installment will cover just such a protocol.</p> Speaking as someone who lives in a relatively developed country, it is apparent that the significance of a decentralized, peer-to-peer payment solution is taken for granted.\n\nIn the developed world, we are fortunate enough to have experienced a thorough proliferation of internet-connected devices, well-maintained internet infrastructure, and many pseudo-bank applications built on top of the internet stack. These aspects “democratize” finance, in a sense. One need not trust that their bank teller is giving them the correct balance information — we have countless solutions for this.\n\nConsider those developing nations though, where currencies are prone to hyperinflation, internet infrastructure is poor or nonexistent, and the proliferation of smart devices has not nearly reached a critical mass. For these nations, bitcoin is an obvious solution to many of their problems, but bitcoin being an “internet-native” form of money creates a seemingly insurmountable obstacle to those who wish to use the network.\n\nThat is, until recently…\n\nBitcoin for Africa\nBitcoin is a fantastic tool for individuals interested in creating more sovereignty in their financial lives, but again, without an internet-connected device, progress along that path is greatly hindered.\n\nApart from the outlier, South Africa, Pew Research estimates indicate that a vast majority of sub-Saharan Africans own basic, feature phones — as opposed to smartphones (or internet-connected devices of any kind). Feature phones are so ubiquitous that most Africans use USSD and SMS portal services (text message-based services) in order to access finances, remit money, and purchase goods and services.\n\nAccording to Caribou Digital, a South African research group, approximately 94% of financial transactions on the African continent are processed via SMS-based services, compared to the remaining 6% which are executed in-app. The user behavior is well-understood and practiced daily, and savvy developers have taken note.\n\nMachankura8333 is an SMS-based bitcoin service built by South African developer Kgothatso Ngako “KG.”\n\nThis project represents the first cogent attempt to enable access to bitcoin via feature phones, which again, are not connected to the internet. Fun fact: ‘machankura’ is South African slang for ‘money.’\n\nA recent article from Cointelegraph provides excellent context to this innovation: while the number of feature phones in Africa is nearly double the number of people, smartphone proliferation is not sufficient for a protocol to bank on its users having internet access. In addition, Machankura’s founder KG realized that in order for Africans to appropriately utilize the bitcoin network, they must be provided with the resources to learn about it.\n\nWith this in mind, KG created The Exonumia project, an open-source, African language translation project in which dozens of articles, books, and other educational bitcoin content are translated into 28 languages (at the time of writing). As the project gained momentum, KG decided that he would tackle the fundamental issue: how to access the bitcoin network without internet access.\n\nMaking Machankura\nEnabling feature phones to connect to the bitcoin network might seem an insurmountable task, but the bitcoin network is relatively malleable and can be made to fit a variety of use cases, some of which are extremely complex and involved. However, at its base, the bitcoin network is a decentralized ledger system — it is humans who assign a monetary value to data ownership of varying degrees on the bitcoin network.\n\nKG has designed the protocol to function as simply as possible. First, a user begins by dialing a string of numbers, which varies depending on the country they are located in. At the moment, Machankura is available in 9 countries (Ghana, Kenya, Malawi, Namibia, Nigeria, South Africa, Tanzania, Uganda and Zambia) — and enabling the service in more countries is a top priority for the protocol.\n\nAfter the user makes the initial dial, they will be prompted with a menu of options where they can learn more about bitcoin (linking to Exonumia), or register an account. All that is required to register an account is a user-generated, 5-digit pin. Once registered, another menu is presented: Send Bitcoin or Receive Bitcoin.\n\nSo how does Machankura work, from a technical perspective?\n\nWell, once registered, the user’s phone number is registered Machankura will automatically assign the user a lightning address based on their phone number (e.g. 27123456789@8333.mobi).\n\nHowever, for those privacy-conscious users who would prefer not to expose their phone number in their lightning address, customizable usernames are available (e.g. bitdern@8333.mobi). This feature is enabled through the USSD menu, the selected username will be cross-referenced against a database of established usernames — if the proposed name is not being used, it becomes the user’s pseudonym.\n\nThe Machankura protocol is built upon the lightning network, as such, it comes “out of the box” with connections to any other lightning-enabled transaction service. This means that users of Blixt Wallet in Germany, or Bitcoin Beach Wallet in El Salvador are able to send and receive bitcoin from Africans using Machankura from their feature phones.\n\nIntegrations and Implications\nMachankura has integrated with Bitrefill, a company that allows users to spend their bitcoin on gift cards, groceries, entertainment experiences, prepaid phones, and mobile phone top-ups (which Machankura users are likely quite familiar with). Along with this partnership, Machankura has also integrated with mobile voucher services 1voucher and Azte.co.\n\nEssentially, Machankura users can exchange their local currency for Bitcoin by purchasing a voucher from either of these vendors (in stores that carry them). Once the voucher is paid for and in their possession, the user simply enters the specified code on the voucher into the “Receive Bitcoin” prompt of their Machankura wallet, and presto! Additional funds have been credited to their lightning wallet.\n\nThe implications for Machankura and the integrations established thus far are boundless. This protocol represents an incredible step forward for bitcoin — no longer does a user need to be connected to the internet to benefit from the network.\n\nIn this twitter thread, Machankura founder KG walks us through an afternoon’s quest to purchase as many bearer vouchers as possible in the small village of Moloto, South Africa. KG successfully exchanged local fiat currency for bitcoin bearer vouchers at 7 of the 8 stores he tried — quite a successful proof of concept!\n\nConclusions\nToo often, I find that criticisms of the bitcoin network’s utility are unfounded: bitcoin does not need to be utilized in highly complicated, risky financial schemes and structures. Bitcoin is a straightforward, decentralized ledger system that can be used as a form of money.\n\nFrom the perspective of the developing world, and with respect to bitcoin’s monetary properties, if users are able to send and receive bitcoin, and use that bitcoin to pay for goods and services, then the network is functioning as designed.\n\nThis piece was intended to highlight an exciting application of bitcoin software, one that I believe democratizes the network, and is truly representative of “grass-roots adoption.”\n\nI hope that this content has piqued your interest, and I encourage readers to follow KG and the Machankura team as they continue to build.\n\nThank you for reading, I welcome any feedback in the comments here, or via twitter @bitdern.",
      "topic": "Bitcoin",
      "id": 29
    },
    {
      "title": "howya",
      "body": "derrrrrrrrn",
      "topic": "Bitcoin",
      "id": 31
    }
  ]
}
